## Import

#### Import libraries

In [77]:
import pandas as pd

#### Import Data

##### 1. Actors

In [104]:
adf = pd.read_csv('../old_data/actor.csv')

In [105]:
adf.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [106]:
adf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [107]:
adf.shape

(200, 4)

In [108]:
nan_cols=adf.isna().sum()
nan_cols[nan_cols>0]

Series([], dtype: int64)

Not null values among the columns. The values are correct. 
But we will avoid the column of last_update, there is no valuable information and could infer into errors

In [113]:
adf.drop(['last_update'], axis=1)

     actor_id first_name     last_name
0           1   PENELOPE       GUINESS
1           2       NICK      WAHLBERG
2           3         ED         CHASE
3           4   JENNIFER         DAVIS
4           5     JOHNNY  LOLLOBRIGIDA
..        ...        ...           ...
195       196       BELA        WALKEN
196       197      REESE          WEST
197       198       MARY        KEITEL
198       199      JULIA       FAWCETT
199       200      THORA        TEMPLE

[200 rows x 3 columns]

In [112]:
adf.groupby(['first_name','last_name']).count()

                      actor_id  last_update
first_name last_name
ADAM       GRANT             1            1
           HOPPER            1            1
AL         GARLAND           1            1
ALAN       DREYFUSS          1            1
ALBERT     JOHANSSON         1            1
...                        ...          ...
WILL       WILSON            1            1
WILLIAM    HACKMAN           1            1
WOODY      HOFFMAN           1            1
           JOLIE             1            1
ZERO       CAGE              1            1

[199 rows x 2 columns]

In [110]:
adf.to_csv('../data/actor.csv')

-----------------

##### 2. Category

In [85]:
cdf = pd.read_csv('../old_data/category.csv')

In [86]:
cdf.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [87]:
cdf.shape

(16, 3)

In [88]:
nan_cols=cdf.isna().sum()
nan_cols[nan_cols>0]

Series([], dtype: int64)

Not null values among the columns. The values are correct. 
But we will avoid the column of last_update, there is no valuable information and could infer into errors

In [89]:
cdf.drop(['last_update'], axis=1)

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

In [90]:
cdf.to_csv('../data/category.csv')

-----------------

##### 3. Films

In [91]:
fdf = pd.read_csv('../old_data/film.csv')

In [92]:
fdf.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [95]:
fdf.shape

(1000, 13)

In [96]:
nan_cols=fdf.isna().sum()
nan_cols[nan_cols>0]

original_language_id    1000
dtype: int64

Null values among the whole column of `original_language_id`, so the column will be dropped.
But we will avoid the column of last_update, there is no valuable information and could infer into errors

In [97]:
fdf.drop(columns=['last_update', 'original_language_id'], axis=1, inplace=True)

In [100]:
groupy = fdf.head().groupby(['title'])

In [102]:
groupy.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

In [42]:
fdf.rating.value_counts()

PG-13    223
NC-17    210
R        195
PG       194
G        178
Name: rating, dtype: int64

In [43]:
fdf.release_year.value_counts()

2006    1000
Name: release_year, dtype: int64

In [44]:
fdf.rental_duration.value_counts()

6    212
3    203
4    203
7    191
5    191
Name: rental_duration, dtype: int64

In [45]:
fdf.rating.value_counts()

PG-13    223
NC-17    210
R        195
PG       194
G        178
Name: rating, dtype: int64

In [46]:
fdf.special_features.value_counts()

Trailers,Commentaries,Behind the Scenes                   79
Trailers                                                  72
Trailers,Commentaries                                     72
Trailers,Behind the Scenes                                72
Deleted Scenes,Behind the Scenes                          71
Commentaries,Behind the Scenes                            70
Behind the Scenes                                         70
Trailers,Deleted Scenes                                   66
Commentaries,Deleted Scenes,Behind the Scenes             66
Commentaries,Deleted Scenes                               65
Trailers,Commentaries,Deleted Scenes                      64
Commentaries                                              62
Deleted Scenes                                            61
Trailers,Commentaries,Deleted Scenes,Behind the Scenes    61
Trailers,Deleted Scenes,Behind the Scenes                 49
Name: special_features, dtype: int64

In [55]:
fdf.to_csv('../data/film.csv')

-----------------

##### 4.Inventory

In [57]:
idf = pd.read_csv('../old_data/inventory.csv')

In [58]:
idf.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [59]:
idf.shape

(1000, 4)

In [60]:
nan_cols=idf.isna().sum()
nan_cols[nan_cols>0]

Series([], dtype: int64)

We will drop the column of `last_update` and `store_id`, there is no valuable information and could infer into errors

In [61]:
idf.drop(columns=['last_update', 'store_id'], axis=1, inplace=True)

In [62]:
idf.to_csv('../data/inventory.csv')

-----------------

##### 5.Language

In [63]:
ldf = pd.read_csv('../old_data/language.csv')

In [64]:
ldf.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [65]:
ldf.shape

(6, 3)

In [66]:
nan_cols=ldf.isna().sum()
nan_cols[nan_cols>0]

Series([], dtype: int64)

We will drop the column of `last_update`, there is no valuable information and could infer into errors

In [67]:
ldf.drop(columns=['last_update'], axis=1, inplace=True)

In [68]:
ldf.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [69]:
ldf.to_csv('../data/language.csv')

-------------

##### 6.Old HDD

In [70]:
odf = pd.read_csv('../old_data/old_HDD.csv')

In [71]:
odf.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [ ]:
odf.shape

In [72]:
odf.sort_values(by=['first_name'], inplace=True)

In [73]:
odf

    first_name last_name             title  release_year  category_id
756       ALEC     WAYNE   CHAMBER ITALIAN          2006           12
764       ALEC     WAYNE  FUGITIVE MAGUIRE          2006           16
765       ALEC     WAYNE        HOURS RAGE          2006           13
755       ALEC     WAYNE   CENTER DINOSAUR          2006            4
754       ALEC     WAYNE       CABIN FLASH          2006            3
..         ...       ...               ...           ...          ...
247       ZERO      CAGE     MOD SECRETARY          2006            6
248       ZERO      CAGE   MOONWALKER FOOL          2006           10
249       ZERO      CAGE     OLEANDER CLUE          2006           12
244       ZERO      CAGE      JERSEY SASSY          2006            3
238       ZERO      CAGE       GANDHI KWAI          2006            8

[1000 rows x 5 columns]

In [ ]:
nan_cols=odf.isna().sum()
nan_cols[nan_cols>0]

In [ ]:
odf.to_csv('../data/old_HDD.csv')

-----

##### 7.Rental

In [74]:
rdf = pd.read_csv('../old_data/rental.csv')

In [75]:
rdf.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [ ]:
rdf.shape

In [ ]:
nan_cols=rdf.isna().sum()
nan_cols[nan_cols>0]

In [ ]:
rdf.dtypes

In [ ]:
rdf['rental_date'] = pd.to_datetime(rdf['rental_date'])
rdf['return_date'] = pd.to_datetime(rdf['return_date'])

In [ ]:
rdf.dtypes

In [ ]:
rdf.drop(columns=['last_update', 'customer_id', 'staff_id'], axis=1, inplace=True)

In [ ]:
rdf.head()

In [ ]:
rdf.to_csv('../data/rental.csv')